import { createStore } from 'vuex'

export default createStore({
  state: {
    pregnancy: [
      {
        id: 1,
        index: '100-024',
        prise: '900 ₽',
        text: 'Общий анализ крови с лейкоцитарной формулой + СОЭ: Гемоглобин Лейкоциты Тромбоциты Эритроциты Эритроцитарные индексы (MCV, MCH, MCHC) Лейкоцитарная формула : нейтрофилы, лимфоциты, моноциты, эозинофилы, базофилы, СОЭ( скорость оседания эритроцитов).',
        terms: 'За 1 день',
        home: 'Возможен выезд на дом'
      },
      {
        id: 2,
        index: '100-024',
        prise: '550 ₽',
        text: 'Коагулограмма №2 (протромбин (по Квику), МНО, фибриноген)',
        terms: 'За 1 день',
        home: 'Возможен выезд на дом'
      },
      {
        id: 3,
        index: '100-024',
        prise: '550 ₽',
        text: 'Коагулограмма №2 (протромбин (по Квику), МНО, фибриноген)',
        terms: 'За 1 день',
        home: 'Возможен выезд на дом'
      },
      {
        id: 4,
        index: '100-024',
        prise: '550 ₽',
        text: 'Коагулограмма №2 (протромбин (по Квику), МНО, фибриноген)',
        terms: 'За 1 день',
        home: 'Возможен выезд на дом'
      },
    ],
  },
  getters: {
  },
  mutations: {
  },
  actions: {
  },
  modules: {
  }
})
